lkolbly/cmsis-svd/data/TexasInstruments/LM4F232H5QD.svd
        <register>
          <name>PRI13</name>
          <description>Interrupt 52-53 Priority</description>
          <addressOffset>0x00000434</addressOffset>
          <fields>
            <field>
              <name>NVIC_PRI13_INT52</name>
              <description>Interrupt 52 Priority Mask</description>
              <bitRange>[7:5]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI13_INT53</name>
              <description>Interrupt 53 Priority Mask</description>
              <bitRange>[15:13]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI13_INT54</name>
              <description>Interrupt 54 Priority Mask</description>
              <bitRange>[23:21]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI13_INT55</name>
              <description>Interrupt 55 Priority Mask</description>
              <bitRange>[31:29]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRI14</name>
          <description>Interrupt 56-59 Priority</description>
          <addressOffset>0x00000438</addressOffset>
          <fields>
            <field>
              <name>NVIC_PRI14_INTA</name>
              <description>Interrupt 56 Priority Mask</description>
              <bitRange>[7:5]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI14_INTB</name>
              <description>Interrupt 57 Priority Mask</description>
              <bitRange>[15:13]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI14_INTC</name>
              <description>Interrupt 58 Priority Mask</description>
              <bitRange>[23:21]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI14_INTD</name>
              <description>Interrupt 59 Priority Mask</description>
              <bitRange>[31:29]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRI15</name>
          <description>Interrupt 60-63 Priority</description>
          <addressOffset>0x0000043C</addressOffset>
          <fields>
            <field>
              <name>NVIC_PRI15_INTA</name>
              <description>Interrupt 60 Priority Mask</description>
              <bitRange>[7:5]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI15_INTB</name>
              <description>Interrupt 61 Priority Mask</description>
              <bitRange>[15:13]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI15_INTC</name>
              <description>Interrupt 62 Priority Mask</description>
              <bitRange>[23:21]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI15_INTD</name>
              <description>Interrupt 63 Priority Mask</description>
              <bitRange>[31:29]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRI16</name>
          <description>Interrupt 64-67 Priority</description>
          <addressOffset>0x00000440</addressOffset>
          <fields>
            <field>
              <name>NVIC_PRI16_INTA</name>
              <description>Interrupt 64 Priority Mask</description>
              <bitRange>[7:5]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI16_INTB</name>
              <description>Interrupt 65 Priority Mask</description>
              <bitRange>[15:13]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI16_INTC</name>
              <description>Interrupt 66 Priority Mask</description>
              <bitRange>[23:21]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI16_INTD</name>
              <description>Interrupt 67 Priority Mask</description>
              <bitRange>[31:29]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRI17</name>
          <description>Interrupt 68-71 Priority</description>
          <addressOffset>0x00000444</addressOffset>
          <fields>
            <field>
              <name>NVIC_PRI17_INTA</name>
              <description>Interrupt 68 Priority Mask</description>
              <bitRange>[7:5]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI17_INTB</name>
              <description>Interrupt 69 Priority Mask</description>
              <bitRange>[15:13]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI17_INTC</name>
              <description>Interrupt 70 Priority Mask</description>
              <bitRange>[23:21]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI17_INTD</name>
              <description>Interrupt 71 Priority Mask</description>
              <bitRange>[31:29]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRI18</name>
          <description>Interrupt 72-75 Priority</description>
          <addressOffset>0x00000448</addressOffset>
          <fields>
            <field>
              <name>NVIC_PRI18_INTA</name>
              <description>Interrupt 72 Priority Mask</description>
              <bitRange>[7:5]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI18_INTB</name>
              <description>Interrupt 73 Priority Mask</description>
              <bitRange>[15:13]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI18_INTC</name>
              <description>Interrupt 74 Priority Mask</description>
              <bitRange>[23:21]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI18_INTD</name>
              <description>Interrupt 75 Priority Mask</description>
              <bitRange>[31:29]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRI19</name>
          <description>Interrupt 76-79 Priority</description>
          <addressOffset>0x0000044C</addressOffset>
          <fields>
            <field>
              <name>NVIC_PRI19_INTA</name>
              <description>Interrupt 76 Priority Mask</description>
              <bitRange>[7:5]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI19_INTB</name>
              <description>Interrupt 77 Priority Mask</description>
              <bitRange>[15:13]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI19_INTC</name>
              <description>Interrupt 78 Priority Mask</description>
              <bitRange>[23:21]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI19_INTD</name>
              <description>Interrupt 79 Priority Mask</description>
              <bitRange>[31:29]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRI20</name>
          <description>Interrupt 80-83 Priority</description>
          <addressOffset>0x00000450</addressOffset>
          <fields>
            <field>
              <name>NVIC_PRI20_INTA</name>
              <description>Interrupt 80 Priority Mask</description>
              <bitRange>[7:5]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI20_INTB</name>
              <description>Interrupt 81 Priority Mask</description>
              <bitRange>[15:13]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI20_INTC</name>
              <description>Interrupt 82 Priority Mask</description>
              <bitRange>[23:21]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI20_INTD</name>
              <description>Interrupt 83 Priority Mask</description>
              <bitRange>[31:29]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRI21</name>
          <description>Interrupt 84-87 Priority</description>
          <addressOffset>0x00000454</addressOffset>
          <fields>
            <field>
              <name>NVIC_PRI21_INTA</name>
              <description>Interrupt 84 Priority Mask</description>
              <bitRange>[7:5]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI21_INTB</name>
              <description>Interrupt 85 Priority Mask</description>
              <bitRange>[15:13]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI21_INTC</name>
              <description>Interrupt 86 Priority Mask</description>
              <bitRange>[23:21]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI21_INTD</name>
              <description>Interrupt 87 Priority Mask</description>
              <bitRange>[31:29]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRI22</name>
          <description>Interrupt 88-91 Priority</description>
          <addressOffset>0x00000458</addressOffset>
          <fields>
            <field>
              <name>NVIC_PRI22_INTA</name>
              <description>Interrupt 88 Priority Mask</description>
              <bitRange>[7:5]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI22_INTB</name>
              <description>Interrupt 89 Priority Mask</description>
              <bitRange>[15:13]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI22_INTC</name>
              <description>Interrupt 90 Priority Mask</description>
              <bitRange>[23:21]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI22_INTD</name>
              <description>Interrupt 91 Priority Mask</description>
              <bitRange>[31:29]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRI23</name>
          <description>Interrupt 92-95 Priority</description>
          <addressOffset>0x0000045C</addressOffset>
          <fields>
            <field>
              <name>NVIC_PRI23_INTA</name>
              <description>Interrupt 92 Priority Mask</description>
              <bitRange>[7:5]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI23_INTB</name>
              <description>Interrupt 93 Priority Mask</description>
              <bitRange>[15:13]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI23_INTC</name>
              <description>Interrupt 94 Priority Mask</description>
              <bitRange>[23:21]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI23_INTD</name>
              <description>Interrupt 95 Priority Mask</description>
              <bitRange>[31:29]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRI24</name>
          <description>Interrupt 96-99 Priority</description>
          <addressOffset>0x00000460</addressOffset>
          <fields>
            <field>
              <name>NVIC_PRI24_INTA</name>
              <description>Interrupt 96 Priority Mask</description>
              <bitRange>[7:5]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI24_INTB</name>
              <description>Interrupt 97 Priority Mask</description>
              <bitRange>[15:13]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI24_INTC</name>
              <description>Interrupt 98 Priority Mask</description>
              <bitRange>[23:21]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI24_INTD</name>
              <description>Interrupt 99 Priority Mask</description>
              <bitRange>[31:29]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRI25</name>
          <description>Interrupt 100-103 Priority</description>
          <addressOffset>0x00000464</addressOffset>
          <fields>
            <field>
              <name>NVIC_PRI25_INTA</name>
              <description>Interrupt 100 Priority Mask</description>
              <bitRange>[7:5]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI25_INTB</name>
              <description>Interrupt 101 Priority Mask</description>
              <bitRange>[15:13]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI25_INTC</name>
              <description>Interrupt 102 Priority Mask</description>
              <bitRange>[23:21]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI25_INTD</name>
              <description>Interrupt 103 Priority Mask</description>
              <bitRange>[31:29]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRI26</name>
          <description>Interrupt 104-107 Priority</description>
          <addressOffset>0x00000468</addressOffset>
          <fields>
            <field>
              <name>NVIC_PRI26_INTA</name>
              <description>Interrupt 104 Priority Mask</description>
              <bitRange>[7:5]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI26_INTB</name>
              <description>Interrupt 105 Priority Mask</description>
              <bitRange>[15:13]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI26_INTC</name>
              <description>Interrupt 106 Priority Mask</description>
              <bitRange>[23:21]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI26_INTD</name>
              <description>Interrupt 107 Priority Mask</description>
              <bitRange>[31:29]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRI27</name>
          <description>Interrupt 108-111 Priority</description>
          <addressOffset>0x0000046C</addressOffset>
          <fields>
            <field>
              <name>NVIC_PRI27_INTA</name>
              <description>Interrupt 108 Priority Mask</description>
              <bitRange>[7:5]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI27_INTB</name>
              <description>Interrupt 109 Priority Mask</description>
              <bitRange>[15:13]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI27_INTC</name>
              <description>Interrupt 110 Priority Mask</description>
              <bitRange>[23:21]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI27_INTD</name>
              <description>Interrupt 111 Priority Mask</description>
              <bitRange>[31:29]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRI28</name>
          <description>Interrupt 112-115 Priority</description>
          <addressOffset>0x00000470</addressOffset>
          <fields>
            <field>
              <name>NVIC_PRI28_INTA</name>
              <description>Interrupt 112 Priority Mask</description>
              <bitRange>[7:5]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI28_INTB</name>
              <description>Interrupt 113 Priority Mask</description>
              <bitRange>[15:13]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI28_INTC</name>
              <description>Interrupt 114 Priority Mask</description>
              <bitRange>[23:21]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI28_INTD</name>
              <description>Interrupt 115 Priority Mask</description>
              <bitRange>[31:29]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRI29</name>
          <description>Interrupt 116-119 Priority</description>
          <addressOffset>0x00000474</addressOffset>
          <fields>
            <field>
              <name>NVIC_PRI29_INTA</name>
              <description>Interrupt 116 Priority Mask</description>
              <bitRange>[7:5]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI29_INTB</name>
              <description>Interrupt 117 Priority Mask</description>
              <bitRange>[15:13]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI29_INTC</name>
              <description>Interrupt 118 Priority Mask</description>
              <bitRange>[23:21]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI29_INTD</name>
              <description>Interrupt 119 Priority Mask</description>
              <bitRange>[31:29]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRI30</name>
          <description>Interrupt 120-123 Priority</description>
          <addressOffset>0x00000478</addressOffset>
          <fields>
            <field>
              <name>NVIC_PRI30_INTA</name>
              <description>Interrupt 120 Priority Mask</description>
              <bitRange>[7:5]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI30_INTB</name>
              <description>Interrupt 121 Priority Mask</description>
              <bitRange>[15:13]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI30_INTC</name>
              <description>Interrupt 122 Priority Mask</description>
              <bitRange>[23:21]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI30_INTD</name>
              <description>Interrupt 123 Priority Mask</description>
              <bitRange>[31:29]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRI31</name>
          <description>Interrupt 124-127 Priority</description>
          <addressOffset>0x0000047C</addressOffset>
          <fields>
            <field>
              <name>NVIC_PRI31_INTA</name>
              <description>Interrupt 124 Priority Mask</description>
              <bitRange>[7:5]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI31_INTB</name>
              <description>Interrupt 125 Priority Mask</description>
              <bitRange>[15:13]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI31_INTC</name>
              <description>Interrupt 126 Priority Mask</description>
              <bitRange>[23:21]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI31_INTD</name>
              <description>Interrupt 127 Priority Mask</description>
              <bitRange>[31:29]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRI32</name>
          <description>Interrupt 128-131 Priority</description>
          <addressOffset>0x00000480</addressOffset>
          <fields>
            <field>
              <name>NVIC_PRI32_INTA</name>
              <description>Interrupt 128 Priority Mask</description>
              <bitRange>[7:5]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI32_INTB</name>
              <description>Interrupt 129 Priority Mask</description>
              <bitRange>[15:13]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI32_INTC</name>
              <description>Interrupt 130 Priority Mask</description>
              <bitRange>[23:21]</bitRange>
            </field>
            <field>
              <name>NVIC_PRI32_INTD</name>
              <description>Interrupt 131 Priority Mask</description>
              <bitRange>[31:29]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CPUID</name>
          <description>CPU ID Base</description>
          <addressOffset>0x00000D00</addressOffset>
          <fields>
            <field>
              <name>NVIC_CPUID_REV</name>
              <description>Revision Number</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>NVIC_CPUID_PARTNO</name>
              <description>Part Number</description>
              <bitRange>[15:4]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NVIC_CPUID_PARTNO_CM4</name>
                  <description>Cortex-M4 processor</description>
                  <value>0xc24</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NVIC_CPUID_CON</name>
              <description>Constant</description>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>NVIC_CPUID_VAR</name>
              <description>Variant Number</description>
              <bitRange>[23:20]</bitRange>
            </field>
            <field>
              <name>NVIC_CPUID_IMP</name>
              <description>Implementer Code</description>
              <bitRange>[31:24]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NVIC_CPUID_IMP_ARM</name>
                  <description>ARM</description>
                  <value>0x41</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
